In [1]:
import numpy as np
import pandas as pd

(https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

In [2]:
pwd

'/content'

In [3]:
ls

sample_data/

In [4]:
import os

In [5]:
os.getcwd()

'/content'

In [6]:
pd.read_csv("example.csv")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
pd.read_csv("example.csv", header=None) # If you don't want it to be the header and you actually want that to be a row instead of calling names, you can say header is equal to none.

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [9]:
df = pd.read_csv("example.csv")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df = pd.read_csv("example.csv", index_col=0) # And that just says use the zero index column as my actual index in the data frame.

In [12]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [13]:
pwd

'/content'

In [16]:
df.to_csv("newfile.csv", index=False)

In [17]:
new = pd.read_csv("newfile.csv")
new

    b   c   d
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15

# Video 41. Pandas Input and Output - HTML Tables

In [19]:
pip install lxml

Requirement already satisfied: lxml in /usr/local/lib/python3.7/dist-packages (4.2.6)

In [20]:
url = "https://en.wikipedia.org/wiki/World_population"

In [22]:
tables = pd.read_html(url)

In [23]:
len(tables) # open source and search "<table"

27

In [24]:
tables[0]

        World population (millions, UN estimates)[15]  ...
                                                    #  ...                                            2030[A]
0                                                   1  ...                                               1416
1                                                   2  ...                                               1528
2                                                   3  ...                                                356
3                                                   4  ...                                                295
4                                                   5  ...                                                245
5                                                   6  ...                                                228
6                                                   7  ...                                                263
7                                                   8  ...                                                186
8                                                   9  ...                                                149
9                                                  10  ...                                                148
10                                                NaN  ...                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...  ...  Notes: .mw-parser-output .reflist{font-size:90...

[12 rows x 5 columns]

In [25]:
tables[0].columns

MultiIndex([('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...)],
           )

In [38]:
world_topten = tables[0]

In [39]:
world_top = world_topten["World population (millions, UN estimates)[15]"]
world_top

                                                    #  ...                                            2030[A]
0                                                   1  ...                                               1416
1                                                   2  ...                                               1528
2                                                   3  ...                                                356
3                                                   4  ...                                                295
4                                                   5  ...                                                245
5                                                   6  ...                                                228
6                                                   7  ...                                                263
7                                                   8  ...                                                186
8                                                   9  ...                                                149
9                                                  10  ...                                                148
10                                                NaN  ...                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...  ...  Notes: .mw-parser-output .reflist{font-size:90...

[12 rows x 5 columns]

In [43]:
world_top.iloc[11]

#                                  Notes: .mw-parser-output .reflist{font-size:90...
Top ten most populous countries    Notes: .mw-parser-output .reflist{font-size:90...
2000                               Notes: .mw-parser-output .reflist{font-size:90...
2015                               Notes: .mw-parser-output .reflist{font-size:90...
2030[A]                            Notes: .mw-parser-output .reflist{font-size:90...
Name: 11, dtype: object

In [44]:
world_top = world_top.drop(11,axis=0)

In [45]:
world_top

      # Top ten most populous countries  2000  2015 2030[A]
0     1                        China[B]  1270  1376    1416
1     2                           India  1053  1311    1528
2     3                   United States   283   322     356
3     4                       Indonesia   212   258     295
4     5                        Pakistan   136   208     245
5     6                          Brazil   176   206     228
6     7                         Nigeria   123   182     263
7     8                      Bangladesh   131   161     186
8     9                          Russia   146   146     149
9    10                          Mexico   103   127     148
10  NaN                     World total  6127  7349    8501

In [46]:
world_top = world_top.drop("#", axis=1)

In [47]:
world_top

   Top ten most populous countries  2000  2015 2030[A]
0                         China[B]  1270  1376    1416
1                            India  1053  1311    1528
2                    United States   283   322     356
3                        Indonesia   212   258     295
4                         Pakistan   136   208     245
5                           Brazil   176   206     228
6                          Nigeria   123   182     263
7                       Bangladesh   131   161     186
8                           Russia   146   146     149
9                           Mexico   103   127     148
10                     World total  6127  7349    8501

In [48]:
world_top.columns = ["Country", "2000", "2015", "2030 Est."]
world_top

          Country  2000  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

In [49]:
tables[6]

   Rank         Country  ...  Density(pop/km2)  Population trend
0     1           India  ...               419           Growing
1     2        Pakistan  ...               279           Growing
2     3      Bangladesh  ...              1187   Rapidly growing
3     4           Japan  ...               333     Declining[99]
4     5     Philippines  ...               368           Growing
5     6         Vietnam  ...               290           Growing
6     7  United Kingdom  ...               273            Steady
7     8     South Korea  ...               520            Steady
8     9          Taiwan  ...               652            Steady
9    10       Sri Lanka  ...               332           Growing

[10 rows x 6 columns]

In [51]:
tables[6].set_index("Rank")

             Country  Population  Area(km2)  Density(pop/km2) Population trend
Rank
1              India  1378370000    3287240               419          Growing
2           Pakistan   224020000     803940               279          Growing
3         Bangladesh   170860000     143998              1187  Rapidly growing
4              Japan   126010000     377873               333    Declining[99]
5        Philippines   110380000     300000               368          Growing
6            Vietnam    96209000     331689               290          Growing
7     United Kingdom    66436000     243610               273           Steady
8        South Korea    51781000      99538               520           Steady
9             Taiwan    23604000      36193               652           Steady
10         Sri Lanka    21803000      65610               332          Growing

In [53]:
world_top.to_html("sample_table.html", index=False)

In [54]:
ls

'\content'$'\n''ewfile.csv'   newfile.csv          sample_table.html
 example.csv                  sample_data/
 example.xlsx                 sample_table.hhtml

## Video 42. Pandas Input and Output - Excel Files

Pandas can read and write to Microsoft Excel files, but a really important note here is that pandas can only read and write in the raw data.

If you have a more advanced Excel spreadsheet that has macros or visualizations or specific formulas created inside the spreadsheet, PANDAS is not going to be able to read in those relationships.

It's just going to grab the actual value in the cell and then read it in as a data frame.

(https://www.python-excel.org/)

In [55]:
df = pd.read_excel("my_excel_file.xlsx", sheet_name="First_Sheet")

In [56]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [57]:
# if I do not know shhet names?
wb = pd.ExcelFile("my_excel_file.xlsx")

In [58]:
wb.sheet_names

['First_Sheet']

In [59]:
excel_sheet_dict = pd.read_excel("my_excel_file.xlsx", sheet_name=None)

In [60]:
type(excel_sheet_dict)

dict

In [61]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [62]:
excel_sheet_dict["First_Sheet"]

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [63]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [64]:
# how to write
our_df = excel_sheet_dict["First_Sheet"]

In [65]:
our_df.to_excel("examplemın.xlsx", sheet_name="First_Sheet", index=False)

In [66]:
ls

'\content'$'\n''ewfile.csv'   example.xlsx         sample_data/
 example.csv                  my_excel_file.xlsx   sample_table.hhtml
 examplemın.xlsx              newfile.csv          sample_table.html

# Video 43. Pandas Input and Output - SQL Databases

Step number one is to figure out what sequel engine you're actually connecting to for just a few examples.

This could be something like PostgreSQL, my sequel, Ms.SQL Server, Oracle databases, etc.

Step two is that then install the appropriate Python driver library, and often this just requires a quick Google search.

So you would just Google search PostgreSQL plus Python and you would quickly find that the appropriate Python driver for that is Psycho PJI two or MySQL is PI.

MySQL or a mythical server is pyodbc

Step three is where you use SQL Alchemy Library to actually connect your SQL database with the driver.

https://docs.sqlalchemy.org/en/14/dialects/index.html

use that skill alchemy, driver connection with the pantless read skill method to essentially just pass in that connection as a parameter into the street school.

In [67]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.18)
Requirement already satisfied: importlib-metadata; python_version < "3.8" in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17; python_version >= "3" in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.0)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata; python_version < "3.8"->sqlalchemy) (3.4.1)
Requirement already satisfied: typing-extensions>=3.6.4; python_version < "3.8" in /usr/local/lib/python3.7/dist-packages (from importlib-metadata; python_version < "3.8"->sqlalchemy) (3.7.4.3)

In [68]:
from sqlalchemy import create_engine

In [69]:
temp_db = create_engine("sqlite:///:memory:")

In [73]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=["a","b","c","d"])

In [74]:
df

    a   b   c   d
0  78  35   9  66
1  69  69  13  69
2  42  70  62  75
3  31  23  39  50

In [76]:
df.to_sql(name="new_table", con=temp_db)  #indexyeri burası

In [77]:
df.to_sql(name="new_table", con=temp_db) # ValueError: Table 'new_table' already exists.

ValueError: ignored

In [78]:
new_df = pd.read_sql(sql="new_table",con=temp_db)

In [79]:
new_df #iki üstte index = False yapılırsa index çıkmazdı

   index   a   b   c   d
0      0  78  35   9  66
1      1  69  69  13  69
2      2  42  70  62  75
3      3  31  23  39  50

In [80]:
result = pd.read_sql_query(sql="SELECT a ,c FROM new_table",con=temp_db) #sql formatı çalıştırıldı
result

    a   c
0  78   9
1  69  13
2  42  62
3  31  39

# Video 44. Pandas Pivot Tables

Does it actually need a pivot method call in order to achieve that data frame?

So, again, what do you want that resulting pivot to look like and that resulting data frame?

And does that actually answer your question?

In [83]:
df = pd.read_csv("Sales_Funnel_CRM.csv")
df

    Account Number       Company  ... Sale Price        Status
0          2123398        Google  ...    2100000     Presented
1          2123398        Google  ...     700000     Presented
2          2123398        Google  ...     350000  Under Review
3          2192650          BOBO  ...    2450000          Lost
4           420496          IKEA  ...    4550000           Won
5           636685    Tesla Inc.  ...    2800000  Under Review
6           636685    Tesla Inc.  ...     700000     Presented
7          1216870     Microsoft  ...     350000  Under Review
8          2200450       Walmart  ...    2450000          Lost
9           405886         Apple  ...    4550000           Won
10          470248  Exxon Mobile  ...    2100000     Presented
11          698032           ATT  ...     350000  Under Review
12          698032           ATT  ...     700000     Presented
13          902797    CVS Health  ...     490000           Won
14         2046943    Salesforce  ...    7000000           Won
15         2169499         Cisco  ...    4550000          Lost
16         2169499         Cisco  ...     350000     Presented

[17 rows x 8 columns]

In [84]:
help(pd.pivot)

Help on function pivot in module pandas.core.reshape.pivot:

pivot(data: 'DataFrame', index: Union[Hashable, NoneType, Sequence[Union[Hashable, NoneType]]] = None, columns: Union[Hashable, NoneType, Sequence[Union[Hashable, NoneType]]] = None, values: Union[Hashable, NoneType, Sequence[Union[Hashable, NoneType]]] = None) -> 'DataFrame'
    Return reshaped DataFrame organized by given index / column values.

    Reshape data (produce a "pivot" table) based on column values. Uses
    unique values from specified `index` / `columns` to form axes of the
    resulting DataFrame. This function does not support data
    aggregation, multiple values will result in a MultiIndex in the
    columns. See the :ref:`User Guide <reshaping>` for more on reshaping.

    Parameters
    ----------
    data : DataFrame
    index : str or object or a list of str, optional
        Column to use to make new frame's index. If None, uses
        existing index.

        .. versionchanged:: 1.1.0
           Also accept list of index names.

    columns : str or object or a list of str
        Column to use to make new frame's columns.

        .. versionchanged:: 1.1.0
           Also accept list of columns names.

    values : str, object or a list of the previous, optional
        Column(s) to use for populating new frame's values. If not
        specified, all remaining columns will be used and the result will
        have hierarchically indexed columns.

        .. versionchanged:: 0.23.0
           Also accept list of column names.

    Returns
    -------
    DataFrame
        Returns reshaped DataFrame.

    Raises
    ------
    ValueError:
        When there are any `index`, `columns` combinations with multiple
        values. `DataFrame.pivot_table` when you need to aggregate.

    See Also
    --------
    DataFrame.pivot_table : Generalization of pivot that can handle
        duplicate values for one index/column pair.
    DataFrame.unstack : Pivot based on the index values instead of a
        column.

    Notes
    -----
    For finer-tuned control, see hierarchical indexing documentation along
    with the related stack/unstack methods.

    Examples
    --------
    >>> df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
    ...                            'two'],
    ...                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    ...                    'baz': [1, 2, 3, 4, 5, 6],
    ...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
    >>> df
        foo   bar  baz  zoo
    0   one   A    1    x
    1   one   B    2    y
    2   one   C    3    z
    3   two   A    4    q
    4   two   B    5    w
    5   two   C    6    t

    >>> df.pivot(index='foo', columns='bar', values='baz')
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar')['baz']
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])
          baz       zoo
    bar   A  B  C   A  B  C
    foo
    one   1  2  3   x  y  z
    two   4  5  6   q  w  t

    You could also assign a list of column names or a list of index names.

    >>> df = pd.DataFrame({
    ...        "lev1": [1, 1, 1, 2, 2, 2],
    ...        "lev2": [1, 1, 2, 1, 1, 2],
    ...        "lev3": [1, 2, 1, 2, 1, 2],
    ...        "lev4": [1, 2, 3, 4, 5, 6],
    ...        "values": [0, 1, 2, 3, 4, 5]})
    >>> df
        lev1 lev2 lev3 lev4 values
    0   1    1    1    1    0
    1   1    1    2    2    1
    2   1    2    1    3    2
    3   2    1    2    4    3
    4   2    1    1    5    4
    5   2    2    2    6    5

    >>> df.pivot(index="lev1", columns=["lev2", "lev3"],values="values")
    lev2    1         2
    lev3    1    2    1    2
    lev1
    1     0.0  1.0  2.0  NaN
    2     4.0  3.0  NaN  5.0

    >>> df.pivot(index=["lev1", "lev2"], columns=["lev3"],values="values")
          lev3    1    2
    lev1  lev2
       1     1  0.0  1.0
             2  2.0  NaN
       2     1  4.0  3.0
             2  NaN  5.0

    A ValueError is raised if there are any duplicates.

    >>> df = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
    ...                    "bar": ['A', 'A', 'B', 'C'],
    ...                    "baz": [1, 2, 3, 4]})
    >>> df
       foo bar  baz
    0  one   A    1
    1  one   A    2
    2  two   B    3
    3  two   C    4

    Notice that the first two rows are the same for our `index`
    and `columns` arguments.

    >>> df.pivot(index='foo', columns='bar', values='baz')
    Traceback (most recent call last):
       ...
    ValueError: Index contains duplicate entries, cannot reshape

In [87]:
licenses = df[["Company","Product","Licenses"]]

In [88]:
licenses

         Company          Product  Licenses
0         Google        Analytics       150
1         Google       Prediction       150
2         Google         Tracking       300
3           BOBO        Analytics       150
4           IKEA        Analytics       300
5     Tesla Inc.        Analytics       300
6     Tesla Inc.       Prediction       150
7      Microsoft         Tracking       300
8        Walmart        Analytics       150
9          Apple        Analytics       300
10  Exxon Mobile        Analytics       150
11           ATT         Tracking       150
12           ATT       Prediction       150
13    CVS Health         Tracking       450
14    Salesforce        Analytics       750
15         Cisco        Analytics       300
16         Cisco  GPS Positioning       300

In [89]:
pd.pivot(data=licenses, index="Company",columns="Product",values="Licenses")

Product       Analytics  GPS Positioning  Prediction  Tracking
Company
 Google           150.0              NaN       150.0     300.0
ATT                 NaN              NaN       150.0     150.0
Apple             300.0              NaN         NaN       NaN
BOBO              150.0              NaN         NaN       NaN
CVS Health          NaN              NaN         NaN     450.0
Cisco             300.0            300.0         NaN       NaN
Exxon Mobile      150.0              NaN         NaN       NaN
IKEA              300.0              NaN         NaN       NaN
Microsoft           NaN              NaN         NaN     300.0
Salesforce        750.0              NaN         NaN       NaN
Tesla Inc.        300.0              NaN       150.0       NaN
Walmart           150.0              NaN         NaN       NaN

In [92]:
df.head()

   Account Number  Company      Contact  ... Licenses Sale Price        Status
0         2123398   Google  Larry Pager  ...      150    2100000     Presented
1         2123398   Google  Larry Pager  ...      150     700000     Presented
2         2123398   Google  Larry Pager  ...      300     350000  Under Review
3         2192650     BOBO  Larry Pager  ...      150    2450000          Lost
4          420496     IKEA    Elon Tusk  ...      300    4550000           Won

[5 rows x 8 columns]

In [93]:
pd.pivot_table(df,index="Company", aggfunc="sum")

              Account Number  Licenses  Sale Price
Company
 Google              6370194       600     3150000
ATT                  1396064       300     1050000
Apple                 405886       300     4550000
BOBO                 2192650       150     2450000
CVS Health            902797       450      490000
Cisco                4338998       600     4900000
Exxon Mobile          470248       150     2100000
IKEA                  420496       300     4550000
Microsoft            1216870       300      350000
Salesforce           2046943       750     7000000
Tesla Inc.           1273370       450     3500000
Walmart              2200450       150     2450000

In [94]:
df.groupby("Company").sum()  # the same result with the above code

              Account Number  Licenses  Sale Price
Company
 Google              6370194       600     3150000
ATT                  1396064       300     1050000
Apple                 405886       300     4550000
BOBO                 2192650       150     2450000
CVS Health            902797       450      490000
Cisco                4338998       600     4900000
Exxon Mobile          470248       150     2100000
IKEA                  420496       300     4550000
Microsoft            1216870       300      350000
Salesforce           2046943       750     7000000
Tesla Inc.           1273370       450     3500000
Walmart              2200450       150     2450000

In [95]:
pd.pivot_table(df,index="Company", aggfunc="sum",values=["Licenses","Sale Price"])

              Licenses  Sale Price
Company
 Google            600     3150000
ATT                300     1050000
Apple              300     4550000
BOBO               150     2450000
CVS Health         450      490000
Cisco              600     4900000
Exxon Mobile       150     2100000
IKEA               300     4550000
Microsoft          300      350000
Salesforce         750     7000000
Tesla Inc.         450     3500000
Walmart            150     2450000

In [97]:
pd.pivot_table(df,index=["Account Manager","Contact"],values=["Sale Price"],aggfunc="sum")

                              Sale Price
Account Manager Contact
Claude Shannon  Cindy Phoner     7700000
                Emma Gordian    12390000
Edward Thorp    Elon Tusk        8050000
                Larry Pager      5600000
                Will Grates      2800000

In [99]:
pd.pivot_table(df,index=["Account Manager","Contact"],values=["Sale Price"],columns=["Product"], aggfunc="sum")

                              Sale Price
Product                        Analytics GPS Positioning Prediction  Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner   6650000.0             NaN   700000.0  350000.0
                Emma Gordian  11550000.0        350000.0        NaN  490000.0
Edward Thorp    Elon Tusk      7350000.0             NaN   700000.0       NaN
                Larry Pager    4550000.0             NaN   700000.0  350000.0
                Will Grates    2450000.0             NaN        NaN  350000.0

In [100]:
pd.pivot_table(df,index=["Account Manager","Contact"],values=["Sale Price"],columns=["Product"], aggfunc="sum", fill_value=0)

                             Sale Price
Product                       Analytics GPS Positioning Prediction Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner    6650000               0     700000   350000
                Emma Gordian   11550000          350000          0   490000
Edward Thorp    Elon Tusk       7350000               0     700000        0
                Larry Pager     4550000               0     700000   350000
                Will Grates     2450000               0          0   350000

In [101]:
pd.pivot_table(df,index=["Account Manager","Contact"],values=["Sale Price"],columns=["Product"], aggfunc=[np.sum], fill_value=0)

                                    sum
                             Sale Price
Product                       Analytics GPS Positioning Prediction Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner    6650000               0     700000   350000
                Emma Gordian   11550000          350000          0   490000
Edward Thorp    Elon Tusk       7350000               0     700000        0
                Larry Pager     4550000               0     700000   350000
                Will Grates     2450000               0          0   350000

In [102]:
pd.pivot_table(df,index=["Account Manager","Contact"],values=["Sale Price"],columns=["Product"], aggfunc=[np.sum,np.mean], fill_value=0)

                                    sum                  ...       mean
                             Sale Price                  ... Sale Price
Product                       Analytics GPS Positioning  ... Prediction Tracking
Account Manager Contact                                  ...
Claude Shannon  Cindy Phoner    6650000               0  ...     700000   350000
                Emma Gordian   11550000          350000  ...          0   490000
Edward Thorp    Elon Tusk       7350000               0  ...     700000        0
                Larry Pager     4550000               0  ...     700000   350000
                Will Grates     2450000               0  ...          0   350000

[5 rows x 8 columns]

In [103]:
pd.pivot_table(df,index=["Account Manager","Contact","Product"],values=["Sale Price"], aggfunc=[np.sum], fill_value=0)

                                                    sum
                                             Sale Price
Account Manager Contact      Product
Claude Shannon  Cindy Phoner Analytics          6650000
                             Prediction          700000
                             Tracking            350000
                Emma Gordian Analytics         11550000
                             GPS Positioning     350000
                             Tracking            490000
Edward Thorp    Elon Tusk    Analytics          7350000
                             Prediction          700000
                Larry Pager  Analytics          4550000
                             Prediction          700000
                             Tracking            350000
                Will Grates  Analytics          2450000
                             Tracking            350000

In [104]:
pd.pivot_table(df,index=["Account Manager","Contact","Product"],values=["Sale Price"], aggfunc=[np.sum], fill_value=0,margins=True) # margins give you a grand total at the very end at the margin.

                                                    sum
                                             Sale Price
Account Manager Contact      Product
Claude Shannon  Cindy Phoner Analytics          6650000
                             Prediction          700000
                             Tracking            350000
                Emma Gordian Analytics         11550000
                             GPS Positioning     350000
                             Tracking            490000
Edward Thorp    Elon Tusk    Analytics          7350000
                             Prediction          700000
                Larry Pager  Analytics          4550000
                             Prediction          700000
                             Tracking            350000
                Will Grates  Analytics          2450000
                             Tracking            350000
All                                            36540000